Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Constructor (Identifier)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CastUnitDrawing(
	Identifier castUnitIdentifier
)
Public Sub New (
	castUnitIdentifier As Identifier
)
Parameters
castUnitIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object cast unit.
See Also
Reference
CastUnitDrawing Class
CastUnitDrawing Overload
Tekla.Structures.Drawing Namespace